Repository: islomov/zebra-qr-code-scanner
Catalog: ZebraCodeScanner/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, hi, id, it, ja, ko, ms, nb, nl, pl, pt_br, ru, sv, th, tr, uk, uz, vi, zh_hans, zh_hant

# qr_form.placeholder.location_label
source: Label (Optional)
ar: التسمية (اختياري)
da: Label (Valgfrit)
de: Bezeichnung (Optional)
es: Etiqueta (Opcional)
fi: Tunniste (Valinnainen)
fr: Libellé (Facultatif)
hi: लेबल (वैकल्पिक)
id: Label (Opsional)
it: Etichetta (Facoltativo)
ja: ラベル（任意）
ko: 라벨 (선택)
ms: Label (Pilihan)
nb: Etikett (Valgfritt)
nl: Label (optioneel)
pl: Etykieta (opcjonalnie)
pt_br: Rótulo (Opcional)
ru: Название (необязательно)
sv: Etikett (valfritt)
th: ป้ายกำกับ (ไม่บังคับ)
tr: Etiket (İsteğe bağlı)
uk: Назва (необов'язково)
uz: Yorliq (Ixtiyoriy)
vi: Nhãn (Tùy chọn)
zh_hans: 标签（可选）
zh_hant: 標籤（選填）

# qr_form.placeholder.longitude
source: Longitude (e.g. -74.0060)
ar: خط الطول (مثال -74.0060)
da: Længdegrad (f.eks. -74.0060)
de: Längengrad (z.B. -74.0060)
es: Longitud (ej. -74.0060)
fi: Pituusaste (esim. -74.0060)
fr: Longitude (ex. -74.0060)
hi: देशांतर (जैसे -74.0060)
id: Bujur (cth. -74.0060)
it: Longitudine (es. -74.0060)
ja: 経度（例: -74.0060）
ko: 경도 (예: -74.0060)
ms: Longitud (cth. -74.0060)
nb: Lengdegrad (f.eks. -74.0060)
nl: Lengtegraad (bijv. -74.0060)
pl: Długość geogr. (np. -74.0060)
pt_br: Longitude (ex. -74.0060)
ru: Долгота (напр. -74.0060)
sv: Longitud (t.ex. -74.0060)
th: ลองจิจูด (เช่น -74.0060)
tr: Boylam (ör. -74.0060)
uk: Довгота (напр. -74.0060)
uz: Uzunlik (masalan, -74.0060)
vi: Kinh độ (vd: -74.0060)
zh_hans: 经度（例如 -74.0060）
zh_hant: 經度（例如 -74.0060）

# qr_form.placeholder.message
source: Message
ar: الرسالة
da: Besked
de: Nachricht
es: Mensaje
fi: Viesti
hi: संदेश
id: Pesan
it: Messaggio
ja: メッセージ
ko: 메시지
ms: Mesej
nb: Melding
nl: Bericht
pl: Wiadomość
pt_br: Mensagem
ru: Сообщение
sv: Meddelande
th: ข้อความ
tr: Mesaj
uk: Повідомлення
uz: Xabar
vi: Tin nhắn
zh_hans: 消息
zh_hant: 訊息

# qr_form.placeholder.message_optional
source: Message (Optional)
ar: الرسالة (اختياري)
da: Besked (Valgfrit)
de: Nachricht (Optional)
es: Mensaje (Opcional)
fi: Viesti (Valinnainen)
fr: Message (Facultatif)
hi: संदेश (वैकल्पिक)
id: Pesan (Opsional)
it: Messaggio (Facoltativo)
ja: メッセージ（任意）
ko: 메시지 (선택)
ms: Mesej (Pilihan)
nb: Melding (Valgfritt)
nl: Bericht (optioneel)
pl: Wiadomość (opcjonalnie)
pt_br: Mensagem (Opcional)
ru: Сообщение (необязательно)
sv: Meddelande (valfritt)
th: ข้อความ (ไม่บังคับ)
tr: Mesaj (İsteğe bağlı)
uk: Повідомлення (необов'язково)
uz: Xabar (Ixtiyoriy)
vi: Tin nhắn (Tùy chọn)
zh_hans: 消息（可选）
zh_hant: 訊息（選填）

# qr_form.placeholder.phone_optional
source: Phone (Optional)
ar: الهاتف (اختياري)
da: Telefon (Valgfrit)
de: Telefon (Optional)
es: Teléfono (Opcional)
fi: Puhelin (Valinnainen)
fr: Téléphone (Facultatif)
hi: फ़ोन (वैकल्पिक)
id: Telepon (Opsional)
it: Telefono (Facoltativo)
ja: 電話番号（任意）
ko: 전화번호 (선택)
ms: Telefon (Pilihan)
nb: Telefon (Valgfritt)
nl: Telefoon (optioneel)
pl: Telefon (opcjonalnie)
pt_br: Telefone (Opcional)
ru: Телефон (необязательно)
sv: Telefon (valfritt)
th: โทรศัพท์ (ไม่บังคับ)
tr: Telefon (İsteğe bağlı)
uk: Телефон (необов'язково)
uz: Telefon (Ixtiyoriy)
vi: Điện thoại (Tùy chọn)
zh_hans: 电话（可选）
zh_hant: 電話（選填）

# qr_form.placeholder.subject_optional
source: Subject (Optional)
ar: الموضوع (اختياري)
da: Emne (Valgfrit)
de: Betreff (Optional)
es: Asunto (Opcional)
fi: Aihe (Valinnainen)
fr: Objet (Facultatif)
hi: विषय (वैकल्पिक)
id: Subjek (Opsional)
it: Oggetto (Facoltativo)
ja: 件名（任意）
ko: 제목 (선택)
ms: Subjek (Pilihan)
nb: Emne (Valgfritt)
nl: Onderwerp (optioneel)
pl: Temat (opcjonalnie)
pt_br: Assunto (Opcional)
ru: Тема (необязательно)
sv: Ämne (valfritt)
th: หัวเรื่อง (ไม่บังคับ)
tr: Konu (İsteğe bağlı)
uk: Тема (необов'язково)
uz: Mavzu (Ixtiyoriy)
vi: Chủ đề (Tùy chọn)
zh_hans: 主题（可选）
zh_hant: 主旨（選填）

# qr_form.placeholder.wifi_name
source: Wi-Fi Name (SSD)
ar: اسم Wi-Fi (SSD)
da: Wi-Fi-navn (SSD)
es: Nombre Wi-Fi (SSD)
fi: Wi-Fi-nimi (SSD)
fr: Nom Wi-Fi (SSD)
hi: Wi-Fi नाम (SSD)
id: Nama Wi-Fi (SSD)
it: Nome Wi-Fi (SSD)
ja: Wi-Fi名（SSID）
ko: Wi-Fi 이름 (SSID)
ms: Nama Wi-Fi (SSD)
nb: Wi-Fi-navn (SSD)
nl: Wi-Fi-naam (SSD)
pl: Nazwa Wi-Fi (SSD)
pt_br: Nome Wi-Fi (SSD)
ru: Название Wi-Fi (SSD)
sv: Wi-Fi-namn (SSD)
th: ชื่อ Wi-Fi (SSID)
tr: Wi-Fi Adı (SSD)
uk: Назва Wi-Fi (SSD)
uz: Wi-Fi nomi (SSD)
vi: Tên Wi-Fi (SSD)
zh_hans: Wi-Fi名称（SSID）
zh_hant: Wi-Fi名稱（SSID）

# qr_form.placeholder.wifi_password
source: Wi-Fi Password
ar: كلمة مرور Wi-Fi
da: Wi-Fi-adgangskode
de: Wi-Fi-Passwort
es: Contraseña Wi-Fi
fi: Wi-Fi-salasana
fr: Mot de passe Wi-Fi
hi: Wi-Fi पासवर्ड
id: Kata Sandi Wi-Fi
it: Password Wi-Fi
ja: Wi-Fiパスワード
ko: Wi-Fi 비밀번호
ms: Kata Laluan Wi-Fi
nb: Wi-Fi-passord
nl: Wi-Fi-wachtwoord
pl: Hasło Wi-Fi
pt_br: Senha Wi-Fi
ru: Пароль Wi-Fi
sv: Wi-Fi-lösenord
th: รหัสผ่าน Wi-Fi
tr: Wi-Fi Şifresi
uk: Пароль Wi-Fi
uz: Wi-Fi paroli
vi: Mật khẩu Wi-Fi
zh_hans: Wi-Fi密码
zh_hant: Wi-Fi密碼

# qr_module_style.circle.title
source: Circle
ar: دائرة
da: Cirkel
de: Kreis
es: Círculo
fi: Ympyrä
fr: Cercle
hi: वृत्त
id: Lingkaran
it: Cerchio
ja: 円
ko: 원
ms: Bulatan
nb: Sirkel
nl: Cirkel
pl: Koło
pt_br: Círculo
ru: Круг
sv: Cirkel
th: วงกลม
tr: Daire
uk: Коло
uz: Doira
vi: Tròn
zh_hans: 圆形
zh_hant: 圓形

# qr_module_style.clover.title
source: Clover
ar: برسيم
da: Kløver
de: Kleeblatt
es: Trébol
fi: Apila
fr: Trèfle
hi: क्लोवर
id: Semanggi
it: Trifoglio
ja: クローバー
ko: 클로버
ms: Semanggi
nb: Kløver
nl: Klaver
pl: Koniczyna
pt_br: Trevo
ru: Клевер
sv: Klöver
th: โคลเวอร์
tr: Yonca
uk: Конюшина
uz: Sebargali
vi: Cỏ ba lá
zh_hans: 四叶草
zh_hant: 四葉草

# qr_module_style.diamond.title
source: Diamond
ar: معين
da: Diamant
de: Raute
es: Diamante
fi: Timantti
fr: Losange
hi: हीरा
id: Berlian
it: Diamante
ja: ダイヤモンド
ko: 다이아몬드
ms: Berlian
nb: Diamant
nl: Diamant
pl: Romb
pt_br: Diamante
ru: Ромб
sv: Diamant
th: เพชร
tr: Elmas
uk: Ромб
uz: Olmos
vi: Kim cương
zh_hans: 菱形
zh_hant: 菱形

# qr_module_style.heart.title
source: Heart
ar: قلب
da: Hjerte
de: Herz
es: Corazón
fi: Sydän
fr: Cœur
hi: दिल
id: Hati
it: Cuore
ja: ハート
ko: 하트
ms: Hati
nb: Hjerte
nl: Hart
pl: Serce
pt_br: Coração
ru: Сердце
sv: Hjärta
th: หัวใจ
tr: Kalp
uk: Серце
uz: Yurak
vi: Trái tim
zh_hans: 心形
zh_hant: 愛心

# qr_module_style.hexagon.title
source: Hexagon
ar: سداسي
da: Heksagon
de: Sechseck
es: Hexágono
fi: Kuusikulmio
fr: Hexagone
hi: षट्भुज
id: Segi enam
it: Esagono
ja: 六角形
ko: 육각형
ms: Heksagon
nb: Heksagon
nl: Zeshoek
pl: Sześciokąt
pt_br: Hexágono
ru: Шестиугольник
th: หกเหลี่ยม
tr: Altıgen
uk: Шестикутник
uz: Olti burchak
vi: Lục giác
zh_hans: 六边形
zh_hant: 六邊形

# qr_module_style.leaf.title
source: Leaf
ar: ورقة
da: Blad
de: Blatt
es: Hoja
fi: Lehti
fr: Feuille
hi: पत्ता
id: Daun
it: Foglia
ja: リーフ
ko: 나뭇잎
ms: Daun
nb: Blad
nl: Blad
pl: Liść
pt_br: Folha
ru: Лист
sv: Löv
th: ใบไม้
tr: Yaprak
uk: Листок
uz: Barg
vi: Lá
zh_hans: 叶子
zh_hant: 葉子

# qr_module_style.raindrop.title
source: Drop
ar: قطرة
da: Dråbe
de: Tropfen
es: Gota
fi: Pisara
fr: Goutte
hi: बूंद
id: Tetesan
it: Goccia
ja: ドロップ
ko: 물방울
ms: Titisan
nb: Dråpe
nl: Druppel
pl: Kropla
pt_br: Gota
ru: Капля
sv: Droppe
th: หยดน้ำ
tr: Damla
uk: Крапля
uz: Tomchi
vi: Giọt nước
zh_hans: 水滴
zh_hant: 水滴

# qr_module_style.rounded_square.title
source: Rounded
ar: مستدير
da: Afrundet
de: Abgerundet
es: Redondeado
fi: Pyöristetty
fr: Arrondi
hi: गोलाकार
id: Membulat
it: Arrotondato
ja: 角丸
ko: 둥근 사각
ms: Bulat
nb: Avrundet
nl: Afgerond
pl: Zaokrąglony
pt_br: Arredondado
ru: Скруглённый
sv: Rundad
th: มุมโค้ง
tr: Yuvarlatılmış
uk: Заокруглений
uz: Yumaloqlangan
vi: Bo tròn
zh_hans: 圆角
zh_hant: 圓角

# qr_module_style.scannability_warning
source: This shape may reduce QR code scannability
ar: قد يقلل هذا الشكل من قابلية مسح رمز QR
da: Denne form kan reducere QR-kodens scanbarhed
de: Diese Form kann die Lesbarkeit des QR Code verringern
es: Esta forma puede reducir la legibilidad del QR Code
fi: Tämä muoto saattaa heikentää QR-koodin skannattavuutta
fr: Cette forme peut réduire la lisibilité du QR Code
hi: यह आकार QR कोड की स्कैनेबिलिटी कम कर सकता है
id: Bentuk ini dapat mengurangi kemampuan pemindaian kode QR
it: Questa forma potrebbe ridurre la leggibilità del QR Code
ja: この形状はQRコードの読み取り精度を低下させる場合があります
ko: 이 모양은 QR 코드 스캔 성능을 저하시킬 수 있습니다
ms: Bentuk ini mungkin mengurangkan kebolehimbasan QR Code
nb: Denne formen kan redusere QR-kodens skannbarhet
nl: Deze vorm kan de scanbaarheid van de QR-code verminderen
pl: Ten kształt może obniżyć czytelność kodu QR
pt_br: Esta forma pode reduzir a legibilidade do QR Code
ru: Эта форма может снизить считываемость QR-кода
sv: Denna form kan minska QR-kodens läsbarhet
th: รูปร่างนี้อาจลดความสามารถในการสแกน QR โค้ด
tr: Bu şekil QR kodun taranabilirliğini azaltabilir
uk: Ця форма може знизити зчитуваність QR-коду
uz: Bu shakl QR kod skanlanishini yomonlashtirishi mumkin
vi: Hình dạng này có thể giảm khả năng quét mã QR
zh_hans: 此形状可能降低二维码的可扫描性
zh_hant: 此形狀可能降低QR碼的可掃描性

# qr_module_style.square.title
source: Square
ar: مربع
da: Firkant
de: Quadrat
es: Cuadrado
fi: Neliö
fr: Carré
hi: वर्ग
id: Kotak
it: Quadrato
ja: 四角
ko: 사각형
ms: Segi Empat
nb: Firkant
nl: Vierkant
pl: Kwadrat
pt_br: Quadrado
ru: Квадрат
sv: Kvadrat
th: สี่เหลี่ยม
tr: Kare
uk: Квадрат
uz: Kvadrat
vi: Vuông
zh_hans: 方形
zh_hant: 方形

# qr_module_style.star.title
source: Star
ar: نجمة
da: Stjerne
de: Stern
es: Estrella
fi: Tähti
fr: Étoile
hi: तारा
id: Bintang
it: Stella
ja: 星
ko: 별
ms: Bintang
nb: Stjerne
nl: Ster
pl: Gwiazda
pt_br: Estrela
ru: Звезда
sv: Stjärna
th: ดาว
tr: Yıldız
uk: Зірка
uz: Yulduz
vi: Ngôi sao
zh_hans: 星形
zh_hant: 星形

# scan_mode.barcode
source: Barcode
ar: باركود
da: Stregkode
es: Código de barras
fi: Viivakoodi
fr: Code-barres
hi: बारकोड
it: Codice a barre
ja: バーコード
ko: 바코드
ms: Kod Bar
nb: Strekkode
nl: Streepjescode
pl: Kod kreskowy
pt_br: Código de barras
ru: Штрих-код
sv: Streckkod
th: บาร์โค้ด
tr: Barkod
uk: Штрих-код
uz: Shtrix-kod
vi: Mã vạch
zh_hans: 条形码
zh_hant: 條碼

# scan_result.copied_message
source: Content copied to clipboard.
ar: تم نسخ المحتوى إلى الحافظة.
da: Indhold kopieret til udklipsholder.
de: Inhalt in die Zwischenablage kopiert.
es: Contenido copiado al portapapeles.
fi: Sisältö kopioitu leikepöydälle.
fr: Contenu copié dans le presse-papiers.
hi: कंटेंट क्लिपबोर्ड पर कॉपी हो गया।
id: Konten disalin ke clipboard.
it: Contenuto copiato negli appunti.
ja: 内容をクリップボードにコピーしました。
ko: 내용이 클립보드에 복사되었습니다.
ms: Kandungan disalin ke papan keratan.
nb: Innhold kopiert til utklippstavlen.
nl: Inhoud gekopieerd naar klembord.
pl: Treść skopiowano do schowka.
pt_br: Conteúdo copiado para a área de transferência.
ru: Содержимое скопировано в буфер обмена.
sv: Innehåll kopierat till urklipp.
th: คัดลอกเนื้อหาไปยังคลิปบอร์ดแล้ว
tr: İçerik panoya kopyalandı.
uk: Вміст скопійовано до буфера обміну.
uz: Kontent vaqtinchalik xotiraga nusxalandi.
vi: Đã sao chép nội dung vào clipboard.
zh_hans: 内容已复制到剪贴板。
zh_hant: 內容已複製到剪貼簿。

# scan_result.nav_title
source: Scan result
ar: نتيجة المسح
da: Scanresultat
de: Scan-Ergebnis
es: Resultado del escaneo
fi: Skannauksen tulos
fr: Résultat du scan
hi: स्कैन परिणाम
id: Hasil pindai
it: Risultato scansione
ja: スキャン結果
ko: 스캔 결과
ms: Hasil imbasan
nb: Skanneresultat
nl: Scanresultaat
pl: Wynik skanowania
pt_br: Resultado da leitura
ru: Результат сканирования
sv: Skanningsresultat
th: ผลลัพธ์การสแกน
tr: Tarama sonucu
uk: Результат сканування
uz: Skan natijasi
vi: Kết quả quét
zh_hans: 扫描结果
zh_hant: 掃描結果

# scan_result.open_url
source: Open URL
ar: فتح URL
da: Åbn URL
de: URL öffnen
es: Abrir URL
fi: Avaa URL
fr: Ouvrir l'URL
hi: URL खोलें
id: Buka URL
it: Apri URL
ja: URLを開く
ko: URL 열기
ms: Buka URL
nb: Åpne URL
pl: Otwórz URL
pt_br: Abrir URL
ru: Открыть URL
sv: Öppna URL
th: เปิด URL
tr: URL Aç
uk: Відкрити URL
uz: URL ochish
vi: Mở URL
zh_hans: 打开URL
zh_hant: 開啟URL

# scan_result.scan_again
source: Scan again
ar: مسح مرة أخرى
da: Scan igen
de: Erneut scannen
es: Escanear de nuevo
fi: Skannaa uudelleen
fr: Scanner à nouveau
hi: फिर से स्कैन करें
id: Pindai lagi
it: Scansiona di nuovo
ja: 再スキャン
ko: 다시 스캔
ms: Imbas lagi
nb: Skann på nytt
nl: Opnieuw scannen
pl: Skanuj ponownie
pt_br: Escanear novamente
ru: Сканировать снова
sv: Skanna igen
th: สแกนอีกครั้ง
tr: Tekrar tara
uk: Сканувати знову
uz: Qayta skanlash
vi: Quét lại
zh_hans: 重新扫描
zh_hant: 重新掃描

# scan_result.scanned_content
source: Scanned Content
ar: المحتوى الممسوح
da: Scannet indhold
de: Gescannter Inhalt
es: Contenido escaneado
fi: Skannattu sisältö
fr: Contenu scanné
hi: स्कैन किया गया कंटेंट
id: Konten yang Dipindai
it: Contenuto scansionato
ja: スキャン内容
ko: 스캔된 내용
ms: Kandungan Diimbas
nb: Skannet innhold
nl: Gescande inhoud
pl: Zeskanowana treść
pt_br: Conteúdo escaneado
ru: Отсканированное содержимое
sv: Skannat innehåll
th: เนื้อหาที่สแกน
tr: Taranan İçerik
uk: Відсканований вміст
uz: Skanlangan kontent
vi: Nội dung đã quét
zh_hans: 扫描内容
zh_hant: 掃描內容

# scan.error.camera_restricted
source: Camera access is required to scan codes. Please enable it in Settings.
ar: يلزم الوصول إلى الكاميرا لمسح الرموز. يرجى تفعيله في الإعدادات.
da: Kameraadgang er påkrævet for at scanne koder. Aktivér det venligst i Indstillinger.
de: Kamerazugriff ist zum Scannen von Codes erforderlich. Bitte aktiviere ihn in den Einstellungen.
es: Se requiere acceso a la cámara para escanear códigos. Por favor, actívalo en Ajustes.
fi: Kameran käyttöoikeus vaaditaan koodien skannaamiseen. Ota se käyttöön Asetuksissa.
fr: L'accès à la caméra est nécessaire pour scanner les codes. Veuillez l'activer dans les Réglages.
hi: कोड स्कैन करने के लिए कैमरा एक्सेस आवश्यक है। कृपया सेटिंग्स में इसे सक्षम करें।
id: Akses kamera diperlukan untuk memindai kode. Silakan aktifkan di Pengaturan.
it: L'accesso alla fotocamera è necessario per scansionare i codici. Abilitalo nelle Impostazioni.
ja: コードをスキャンするにはカメラへのアクセスが必要です。設定で有効にしてください。
ko: 코드를 스캔하려면 카메라 접근 권한이 필요합니다. 설정에서 활성화해 주세요.
ms: Akses kamera diperlukan untuk mengimbas kod. Sila dayakannya dalam Tetapan.
nb: Kameratilgang kreves for å skanne koder. Vennligst aktiver det i Innstillinger.
nl: Cameratoegang is vereist om codes te scannen. Schakel het in via Instellingen.
pl: Dostęp do aparatu jest wymagany do skanowania kodów. Włącz go w Ustawieniach.
pt_br: O acesso à câmera é necessário para escanear códigos. Ative-o nos Ajustes.
ru: Для сканирования кодов требуется доступ к камере. Включите его в Настройках.
sv: Kameraåtkomst krävs för att skanna koder. Aktivera det i Inställningar.
th: ต้องใช้สิทธิ์เข้าถึงกล้องเพื่อสแกนโค้ด กรุณาเปิดใช้งานในการตั้งค่า
tr: Kodları taramak için kamera erişimi gereklidir. Lütfen Ayarlar'dan etkinleştirin.
uk: Для сканування кодів потрібен доступ до камери. Увімкніть його в Налаштуваннях.
uz: Kodlarni skanlash uchun kameraga ruxsat kerak. Iltimos, Sozlamalardan yoqing.
vi: Cần quyền truy cập camera để quét mã. Vui lòng bật trong Cài đặt.
zh_hans: 需要相机访问权限才能扫描码。请在设置中开启。
zh_hant: 需要相機存取權限才能掃描碼。請在設定中開啟。

# scan.error.failed_to_load_image
source: Failed to load image
ar: فشل تحميل الصورة
da: Kunne ikke indlæse billede
de: Bild konnte nicht geladen werden
es: Error al cargar la imagen
fi: Kuvan lataus epäonnistui
fr: Échec du chargement de l'image
hi: इमेज लोड करना विफल रहा
id: Gagal memuat gambar
it: Impossibile caricare l'immagine
ja: 画像の読み込みに失敗しました
ko: 이미지를 불러오지 못했습니다
ms: Gagal memuatkan imej
nb: Kunne ikke laste inn bilde
nl: Kan afbeelding niet laden
pl: Nie udało się załadować obrazu
pt_br: Falha ao carregar a imagem
ru: Не удалось загрузить изображение
sv: Det gick inte att ladda bilden
th: โหลดรูปภาพไม่สำเร็จ
tr: Görsel yüklenemedi
uk: Не вдалося завантажити зображення
uz: Rasmni yuklab bo'lmadi
vi: Không thể tải ảnh
zh_hans: 图片加载失败
zh_hant: 圖片載入失敗

# scan.error.invalid_image
source: Invalid image format
ar: صيغة صورة غير صالحة
da: Ugyldigt billedformat
de: Ungültiges Bildformat
es: Formato de imagen no válido
fi: Virheellinen kuvamuoto
fr: Format d'image non valide
hi: अमान्य इमेज फ़ॉर्मेट
id: Format gambar tidak valid
it: Formato immagine non valido
ja: 無効な画像形式です
ko: 잘못된 이미지 형식입니다
ms: Format imej tidak sah
nb: Ugyldig bildeformat
nl: Ongeldig afbeeldingsformaat
pl: Nieprawidłowy format obrazu
pt_br: Formato de imagem inválido
ru: Неверный формат изображения
sv: Ogiltigt bildformat
th: รูปแบบรูปภาพไม่ถูกต้อง
tr: Geçersiz görsel formatı
uk: Невірний формат зображення
uz: Noto'g'ri rasm formati
vi: Định dạng ảnh không hợp lệ
zh_hans: 无效的图片格式
zh_hant: 無效的圖片格式

# scan.error.no_code_found
source: No QR code or barcode found in this image
ar: لم يتم العثور على رمز QR أو باركود في هذه الصورة
da: Ingen QR Code eller stregkode fundet i dette billede
de: Kein QR Code oder Barcode in diesem Bild gefunden
es: No se encontró ningún QR Code o código de barras en esta imagen
fi: QR Codea tai viivakoodia ei löytynyt tästä kuvasta
fr: Aucun QR Code ou code-barres trouvé dans cette image
hi: इस इमेज में कोई QR कोड या बारकोड नहीं मिला
id: Tidak ditemukan kode QR atau barcode di gambar ini
it: Nessun QR Code o codice a barre trovato in questa immagine
ja: この画像にQRコードまたはバーコードが見つかりませんでした
ko: 이 이미지에서 QR 코드 또는 바코드를 찾을 수 없습니다
ms: Tiada QR Code atau kod bar ditemui dalam imej ini
nb: Ingen QR Code eller strekkode funnet i dette bildet
nl: Geen QR-code of streepjescode gevonden in deze afbeelding
pl: Nie znaleziono kodu QR ani kreskowego na tym obrazie
pt_br: Nenhum QR Code ou código de barras encontrado nesta imagem
ru: QR-код или штрих-код не найден на этом изображении
sv: Ingen QR-kod eller streckkod hittades i denna bild
th: ไม่พบ QR โค้ดหรือบาร์โค้ดในรูปภาพนี้
tr: Bu görselde QR kod veya barkod bulunamadı
uk: QR-код або штрих-код не знайдено на цьому зображенні
uz: Bu rasmda QR Code yoki shtrix-kod topilmadi
vi: Không tìm thấy mã QR hoặc mã vạch trong ảnh này
zh_hans: 未在此图片中找到二维码或条形码
zh_hant: 未在此圖片中找到QR碼或條碼

# scan.error.scan_failed
source: Failed to scan image:
ar: فشل مسح الصورة:
da: Kunne ikke scanne billede:
de: Bild konnte nicht gescannt werden:
es: Error al escanear la imagen:
fi: Kuvan skannaus epäonnistui:
fr: Échec du scan de l'image :
hi: इमेज स्कैन करना विफल रहा:
id: Gagal memindai gambar:
it: Impossibile scansionare l'immagine:
ja: 画像のスキャンに失敗しました：
ko: 이미지 스캔에 실패했습니다:
ms: Gagal mengimbas imej:
nb: Kunne ikke skanne bilde:
nl: Kan afbeelding niet scannen:
pl: Nie udało się zeskanować obrazu:
pt_br: Falha ao escanear a imagem:
ru: Не удалось отсканировать изображение:
sv: Det gick inte att skanna bilden:
th: สแกนรูปภาพไม่สำเร็จ:
tr: Görsel taranamadı:
uk: Не вдалося відсканувати зображення:
uz: Rasmni skanlab bo'lmadi:
vi: Quét ảnh thất bại:
zh_hans: 图片扫描失败：
zh_hant: 圖片掃描失敗：

# scan.error.unavailable
source: Scanning is currently unavailable. Please try again later.
ar: المسح غير متاح حالياً. يرجى المحاولة مرة أخرى لاحقاً.
da: Scanning er i øjeblikket utilgængelig. Prøv venligst igen senere.
de: Scannen ist derzeit nicht verfügbar. Bitte versuche es später erneut.
es: El escaneo no está disponible en este momento. Inténtalo de nuevo más tarde.
fi: Skannaus ei ole tällä hetkellä käytettävissä. Yritä myöhemmin uudelleen.
fr: Le scan n'est pas disponible actuellement. Veuillez réessayer plus tard.
hi: स्कैनिंग वर्तमान में अनुपलब्ध है। कृपया बाद में पुनः प्रयास करें।
id: Pemindaian saat ini tidak tersedia. Silakan coba lagi nanti.
it: La scansione non è al momento disponibile. Riprova più tardi.
ja: スキャンは現在利用できません。後でもう一度お試しください。
ko: 현재 스캔을 사용할 수 없습니다. 나중에 다시 시도해 주세요.
ms: Pengimbasan tidak tersedia buat masa ini. Sila cuba lagi kemudian.
nb: Skanning er for øyeblikket utilgjengelig. Vennligst prøv igjen senere.
nl: Scannen is momenteel niet beschikbaar. Probeer het later opnieuw.
pl: Skanowanie jest tymczasowo niedostępne. Spróbuj ponownie później.
pt_br: A leitura não está disponível no momento. Tente novamente mais tarde.
ru: Сканирование временно недоступно. Попробуйте позже.
sv: Skanning är för närvarande inte tillgänglig. Försök igen senare.
th: การสแกนไม่พร้อมใช้งานในขณะนี้ กรุณาลองอีกครั้งในภายหลัง
tr: Tarama şu anda kullanılamıyor. Lütfen daha sonra tekrar deneyin.
uk: Сканування тимчасово недоступне. Спробуйте пізніше.
uz: Skanlash hozircha mavjud emas. Iltimos, keyinroq qayta urinib ko'ring.
vi: Chức năng quét hiện không khả dụng. Vui lòng thử lại sau.
zh_hans: 扫描功能暂不可用。请稍后再试。
zh_hant: 掃描功能暫時無法使用。請稍後再試。

# scan.error.unsupported
source: This device does not support barcode scanning.
ar: هذا الجهاز لا يدعم مسح الباركود.
da: Denne enhed understøtter ikke stregkodescanning.
de: Dieses Gerät unterstützt das Scannen von Barcodes nicht.
es: Este dispositivo no es compatible con el escaneo de códigos de barras.
fi: Tämä laite ei tue viivakoodien skannausta.
fr: Cet appareil ne prend pas en charge le scan de codes-barres.
hi: यह डिवाइस बारकोड स्कैनिंग सपोर्ट नहीं करता।
id: Perangkat ini tidak mendukung pemindaian barcode.
it: Questo dispositivo non supporta la scansione dei codici a barre.
ja: このデバイスはバーコードスキャンに対応していません。
ko: 이 기기는 바코드 스캔을 지원하지 않습니다.
ms: Peranti ini tidak menyokong pengimbasan kod bar.
nb: Denne enheten støtter ikke strekkodeskanning.
nl: Dit apparaat ondersteunt het scannen van streepjescodes niet.
pl: To urządzenie nie obsługuje skanowania kodów kreskowych.
pt_br: Este dispositivo não suporta a leitura de códigos de barras.
ru: Это устройство не поддерживает сканирование штрих-кодов.
sv: Den här enheten stöder inte streckkodsläsning.
th: อุปกรณ์นี้ไม่รองรับการสแกนบาร์โค้ด
tr: Bu cihaz barkod taramayı desteklemiyor.
uk: Цей пристрій не підтримує сканування штрих-кодів.
uz: Bu qurilma shtrix-kod skanlashni qo'llab-quvvatlamaydi.
vi: Thiết bị này không hỗ trợ quét mã vạch.
zh_hans: 此设备不支持条形码扫描。
zh_hant: 此裝置不支援條碼掃描。

# scan.header.title
source: Scan
ar: مسح
de: Scannen
es: Escanear
fi: Skannaa
fr: Scanner
hi: स्कैन
id: Pindai
it: Scansiona
ja: スキャン
ko: 스캔
ms: Imbas
nb: Skann
pl: Skanuj
pt_br: Escanear
ru: Сканер
sv: Skanna
th: สแกน
tr: Tara
uk: Сканер
uz: Skanlash
vi: Quét
zh_hans: 扫描
zh_hant: 掃描

# scan.manual_entry.placeholder
source: Enter barcode number
ar: أدخل رقم الباركود
da: Indtast stregkodenummer
de: Barcode-Nummer eingeben
es: Ingresa el número de código de barras
fi: Syötä viivakoodinumero
fr: Saisissez le numéro du code-barres
hi: बारकोड नंबर दर्ज करें
id: Masukkan nomor barcode
it: Inserisci il numero del codice a barre
ja: バーコード番号を入力
ko: 바코드 번호 입력
ms: Masukkan nombor kod bar
nb: Skriv inn strekkodenummer
nl: Voer streepjescodenummer in
pl: Wpisz numer kodu kreskowego
pt_br: Digite o número do código de barras
ru: Введите номер штрих-кода
sv: Ange streckkodsnummer
th: กรอกหมายเลขบาร์โค้ด
tr: Barkod numarasını girin
uk: Введіть номер штрих-коду
uz: Shtrix-kod raqamini kiriting
vi: Nhập số mã vạch
zh_hans: 输入条形码号码
zh_hant: 輸入條碼號碼

# scan.manual_entry.search
source: Search
ar: بحث
da: Søg
de: Suchen
es: Buscar
fi: Hae
fr: Rechercher
hi: खोजें
id: Cari
it: Cerca
ja: 検索
ko: 검색
ms: Cari
nb: Søk
nl: Zoeken
pl: Szukaj
pt_br: Pesquisar
ru: Поиск
sv: Sök
th: ค้นหา
tr: Ara
uk: Пошук
uz: Qidirish
vi: Tìm kiếm
zh_hans: 搜索
zh_hant: 搜尋

# scan.manual_entry.title
source: Enter Barcode
ar: إدخال الباركود
da: Indtast stregkode
de: Barcode eingeben
es: Ingresar código de barras
fi: Syötä viivakoodi
fr: Saisir un code-barres
hi: बारकोड दर्ज करें
id: Masukkan Barcode
it: Inserisci codice a barre
ja: バーコードを入力
ko: 바코드 입력
ms: Masukkan Kod Bar
nb: Skriv inn strekkode
nl: Streepjescode invoeren
pl: Wpisz kod kreskowy
pt_br: Inserir código de barras
ru: Ввести штрих-код
sv: Ange streckkod
th: กรอกบาร์โค้ด
tr: Barkod Girin
uk: Ввести штрих-код
uz: Shtrix-kodni kiriting
vi: Nhập mã vạch
zh_hans: 输入条形码
zh_hant: 輸入條碼
